#include <stdio.h>
#include <conio.h>
#include <stdlib.h>
#define p printf
#define s scanf
#define g gotoxy
#define cp cprintf
#define tc textcolor

int limNum, maxNum, num, r, x, choice,loop;

void main()
{
	// TurboLotto: Logo Intro
	clrscr();

	tc(LIGHTGREEN);
	//frame
	g( 1, 1); cp(" здддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд© ");
	// left side
	g( 1, 2); cp(" Ё "); g( 1, 3); cp(" Ё "); g( 1, 4); cp(" Ё "); g( 1, 5); cp(" Ё "); g( 1, 6); cp(" Ё ");
	g( 1, 7); cp(" Ё "); g( 1, 8); cp(" Ё "); g( 1, 9); cp(" Ё "); g( 1,10); cp(" Ё "); g( 1,11); cp(" Ё ");
	g( 1,12); cp(" Ё "); g( 1,13); cp(" Ё "); g( 1,14); cp(" Ё "); g( 1,15); cp(" Ё "); g( 1,16); cp(" Ё ");
	g( 1,17); cp(" Ё "); g( 1,18); cp(" Ё "); g( 1,19); cp(" Ё "); g( 1,20); cp(" Ё ");
	g( 1,21); cp(" Ё "); g( 1,22); cp(" Ё "); g( 1,23);
	//right side
	g(76, 2); cp(" Ё "); g(76, 3); cp(" Ё "); g(76, 4); cp(" Ё "); g(76, 5); cp(" Ё "); g(76, 6); cp(" Ё ");
	g(76, 7); cp(" Ё "); g(76, 8); cp(" Ё "); g(76, 9); cp(" Ё "); g(76,10); cp(" Ё "); g(76,11); cp(" Ё ");
	g(76,12); cp(" Ё "); g(76,13); cp(" Ё "); g(76,14); cp(" Ё "); g(76,15); cp(" Ё "); g(76,16); cp(" Ё ");
	g(76,17); cp(" Ё "); g(76,18); cp(" Ё "); g(76,19); cp(" Ё "); g(76,20); cp(" Ё ");
	g(76,21); cp(" Ё "); g(76,22); cp(" Ё ");
	g( 1,23); cp(" юдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды ");

	g(12, 2); cp(" здддддддддддд© ");
	g(12, 3); cp(" ЁЁ           ЁЁ ");
	g(12, 4); cp(" ЁЁ           ЁЁ ");
	g(12, 5); cp(" ЁЁ    зддддддддддддддддддддддд© ");
	g(12, 6); cp(" ЁЁ    ЁЁ                      ЁЁ ");
	g(12, 7); cp(" ЁЁ    ЁЁ                      ЁЁ ");
	g(12, 8); cp(" ЁЁ    ЁЁ                      ЁЁ ");
	g(12, 9); cp(" ЁЁ    юддддддЁ©       здддддддыы ");
	g(12,10); cp(" ЁЁ           ЁЁ       ЁЁ ");
	g(12,11); cp(" ЁЁ           ЁЁ       ЁЁ ");
	g(12,12); cp(" ЁЁ           ЁЁ       ЁЁ       T u r b o ");
	g(12,13); cp(" ЁЁ           ЁЁ       ЁЁ    дддддддддддддддд ");
	g(12,14); cp(" ЁЁ           ЁЁ       ЁЁ       L o t t o ");
	g(12,15); cp(" ЁЁ           ЁЁ       ЁЁ ");
	g(12,16); cp(" ЁЁ           ЁюдддддддыЁ ");
	g(12,17); cp(" ЁЁ           юдддддддддддддддд© ");
	g(12,18); cp(" ЁЁ                            ЁЁ ");
	g(12,19); cp(" ЁЁ                            ЁЁ ");
	g(12,20); cp(" ЁЁ                            ЁЁ ");
	g(12,21); cp(" ЁЁ                            ЁЁ ");
	g(12,22); cp(" юдддддддддддддддддддддддддддддыы ");

	tc(LIGHTGREEN+BLINK);
	g(48,20); cp("PrEsS AnY KeY To PrOcEeD!!!");
	g(38,24); cp(" ");

	getch();

	for(loop = 0; loop <= 1;)
	{
		//Lotto: Picking Numbers
		clrscr();

		tc(LIGHTGREEN);
		//frame
		g( 1, 1); cp(" здддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд© ");
		// left side
		g( 1, 2); cp(" Ё "); g( 1, 3); cp(" Ё "); g( 1, 4); cp(" Ё "); g( 1, 5); cp(" Ё "); g( 1,6); cp(" Ё ");
		g( 1, 7); cp(" Ё "); g( 1, 8); cp(" Ё "); g( 1, 9); cp(" Ё "); g( 1,10); cp(" Ё "); g( 1,11);cp(" Ё ");
		g( 1,12); cp(" Ё "); g( 1,13); cp(" Ё "); g( 1,14); cp(" Ё "); g( 1,15); cp(" Ё "); g( 1,16);cp(" Ё ");
		g( 1,17); cp(" Ё "); g( 1,18); cp(" Ё "); g( 1,19); cp(" Ё "); g( 1,20); cp(" Ё ");
		g( 1,21); cp(" Ё "); g( 1,22); cp(" Ё "); g( 1,23);
		//right side
		g(76, 2); cp(" Ё "); g(76, 3); cp(" Ё "); g(76, 4); cp(" Ё "); g(76, 5); cp(" Ё "); g(76, 6); cp(" Ё ");
		g(76, 7); cp(" Ё "); g(76, 8); cp(" Ё "); g(76, 9); cp(" Ё "); g(76,10); cp(" Ё "); g(76,11); cp(" Ё ");
		g(76,12); cp(" Ё "); g(76,13); cp(" Ё "); g(76,14); cp(" Ё "); g(76,15); cp(" Ё "); g(76,16); cp(" Ё ");
		g(76,17); cp(" Ё "); g(76,18); cp(" Ё "); g(76,19); cp(" Ё "); g(76,20); cp(" Ё ");
		g(76,21); cp(" Ё "); g(76,22); cp(" Ё ");
		g( 1,23); cp(" юдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды ");

		//anti-blink for inputs
		g(30, 7); cp("      ");
		g(40, 7); cp("       ");

		g(10, 2); cp(" здддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд© ");
		g(10, 3); cp(" Ё       EnTeR ThE NuMbEr Of RaNdOm NuMbErS YoU WaNt...       Ё ");
		g(10, 4); cp(" юдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды ");

		g(13, 5); cp(" ю choose from 1-9 only, otherwise you have to remodel ы ");

		g(30, 8); cp(" юддд ");

		g(33,7); s("%d", &limNum);

		{
			g(10,10); cp(" здддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд© ");
			g(10,11); cp(" Ё    EnTeR ThE MaxNuMbEr Of RaNdOm NuMbErS YoU WaNt...       Ё ");
			g(10,12); cp(" юдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды ");

			g(18,13); cp(" ю 0-99 only or else you may revamp the code ы ");

			g(40, 8); cp(" юдддд ");

			g(43, 7); s("%d", &maxNum);
		}
		tc(LIGHTGREEN);
		g(39,19); cp(" >>HiT EnTeR KeY To StArT...<< ");
		g(41,20); cp(" ...Rollin' OuT ThE CoDeS ");
		g(38,24); cp(" ");

		getch();

		//Lotto: Rollin' Out the Codes (Progress Bar)
		clrscr();

		tc(LIGHTGREEN);
		_setcursortype(_NOCURSOR);
		g( 5,13);
		for(x = 0; x < 70; x++)
		{
			cp("%c", 219); //best bar: 222, 219, 254, 178
			delay(20);
		}
		_setcursortype(_NORMALCURSOR);
		tc(LIGHTGREEN);
		g(29,15); cp(" Rolling Complete!!! ");
		g(22,17); cp(" >>Be ReAdY As YoU PreSs AnY KeY<< ");
		g(38,24); cp(" ");

		getch();

		//Lotto++: Result
		clrscr();

		tc(LIGHTGREEN);
		//frame
		g( 1, 1); cp(" здддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд© ");
		// left side
		g( 1, 2); cp(" Ё "); g( 1, 3); cp(" Ё "); g( 1, 4); cp(" Ё "); g( 1, 5); cp(" Ё "); g( 1, 6); cp(" Ё ");
		g( 1, 7); cp(" Ё "); g( 1, 8); cp(" Ё "); g( 1, 9); cp(" Ё "); g( 1,10); cp(" Ё "); g( 1,11); cp(" Ё ");
		g( 1,12); cp(" Ё "); g( 1,13); cp(" Ё "); g( 1,14); cp(" Ё "); g( 1,15); cp(" Ё "); g( 1,16); cp(" Ё ");
		g( 1,17); cp(" Ё "); g( 1,18); cp(" Ё "); g( 1,19); cp(" Ё "); g( 1,20); cp(" Ё ");
		g( 1,21); cp(" Ё "); g( 1,22); cp(" Ё "); g( 1,23);
		//right side
		g(76, 2); cp(" Ё "); g(76, 3); cp(" Ё "); g(76, 4); cp(" Ё "); g(76, 5); cp(" Ё "); g(76, 6); cp(" Ё ");
		g(76, 7); cp(" Ё "); g(76, 8); cp(" Ё "); g(76, 9); cp(" Ё "); g(76,10); cp(" Ё "); g(76,11); cp(" Ё ");
		g(76,12); cp(" Ё "); g(76,13); cp(" Ё "); g(76,14); cp(" Ё "); g(76,15); cp(" Ё "); g(76,16); cp(" Ё ");
		g(76,17); cp(" Ё "); g(76,18); cp(" Ё "); g(76,19); cp(" Ё "); g(76,20); cp(" Ё ");
		g(76,21); cp(" Ё "); g(76,22); cp(" Ё ");
		g( 1,23); cp(" юдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды ");

		g(15,10); cp(" здддддддддддддддддддддддддддддддддддддддддддддддддд© ");
		g(15,11); cp(" Ё AnD ThE ReSuLt FoR ThE WiNnInG CoMbInAtIoNs ArE: Ё ");
		g(15,12); cp(" юдддддддддддддддддддддддддддддддддддддддддддддддддды \n\n                               ");

		randomize();
		for (r = 1; r <= limNum; r++)
		{
			num = random(maxNum);
			cp("%d   ",num);
		}
		g(17,16); cp(" юдддддддддддддддддддддддддддддд----- ---  --   - ");

		g(1,15); cp(" Ё "); g(76,14); cp(" Ё ");

		g(50,21); cp(" >>Slam the Spacebar... ");

		g(38,24); cp(" ");

		getch();

		//TurboLotto: Exit or Play Again?
		clrscr();

		tc(LIGHTGREEN);
		//frame
		g( 1, 1); cp(" здддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд© ");
		// left side
		g( 1, 2); cp(" Ё "); g( 1, 3); cp(" Ё "); g( 1, 4); cp(" Ё "); g( 1, 5); cp(" Ё "); g( 1, 6); cp(" Ё ");
		g( 1, 7); cp(" Ё "); g( 1, 8); cp(" Ё "); g( 1, 9); cp(" Ё "); g( 1,10); cp(" Ё "); g( 1,11); cp(" Ё ");
		g( 1,12); cp(" Ё "); g( 1,13); cp(" Ё "); g( 1,14); cp(" Ё "); g( 1,15); cp(" Ё "); g( 1,16); cp(" Ё ");
		g( 1,17); cp(" Ё "); g( 1,18); cp(" Ё "); g( 1,19); cp(" Ё "); g( 1,20); cp(" Ё ");
		g( 1,21); cp(" Ё "); g( 1,22); cp(" Ё "); g( 1,23);
		//right side
		g(76, 2); cp(" Ё "); g(76, 3); cp(" Ё "); g(76, 4); cp(" Ё "); g(76, 5); cp(" Ё "); g(76, 6); cp(" Ё ");
		g(76, 7); cp(" Ё "); g(76, 8); cp(" Ё "); g(76, 9); cp(" Ё "); g(76,10); cp(" Ё "); g(76,11); cp(" Ё ");
		g(76,12); cp(" Ё "); g(76,13); cp(" Ё "); g(76,14); cp(" Ё "); g(76,15); cp(" Ё "); g(76,16); cp(" Ё ");
		g(76,17); cp(" Ё "); g(76,18); cp(" Ё "); g(76,19); cp(" Ё "); g(76,20); cp(" Ё ");
		g(76,21); cp(" Ё "); g(76,22); cp(" Ё ");
		g( 1,23); cp(" юдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды ");

		g(23, 9); cp(" здддддддддддддддддддддддддддддд© ");
		g(23,10); cp(" Ё     Do YoU WaNt To QuIt?     Ё ");
		g(23,11); cp(" юдддддддддддддддддддддддддддддды ");

		g(34,16); cp(" 0 - FoR No ");
		g(34,17); cp(" 1 - FoR YeS ");

		g(40,13); cp("     ");

		g(37,14); cp(" юддд ");

		g(40,13); s(" %d",&choice);

		g(27,21); cp(" Press Any Key to Confirm ");

		g(38,24); cp(" ");

		getch();

		//TurboLotto: Closing Remarks
		clrscr();

		tc(LIGHTGREEN);
		//frame
		g( 1, 1); cp(" здддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд© ");
		// left side
		g( 1, 2); cp(" Ё "); g( 1, 3); cp(" Ё "); g( 1, 4); cp(" Ё "); g( 1, 5); cp(" Ё "); g( 1, 6); cp(" Ё ");
		g( 1, 7); cp(" Ё "); g( 1, 8); cp(" Ё "); g( 1, 9); cp(" Ё "); g( 1,10); cp(" Ё "); g( 1,11); cp(" Ё ");
		g( 1,12); cp(" Ё "); g( 1,13); cp(" Ё "); g( 1,14); cp(" Ё "); g( 1,15); cp(" Ё "); g( 1,16); cp(" Ё ");
		g( 1,17); cp(" Ё "); g( 1,18); cp(" Ё "); g( 1,19); cp(" Ё "); g( 1,20); cp(" Ё ");
		g( 1,21); cp(" Ё "); g( 1,22); cp(" Ё "); g( 1,23);
		//right side
		g(76, 2); cp(" Ё "); g(76, 3); cp(" Ё "); g(76, 4); cp(" Ё "); g(76, 5); cp(" Ё "); g(76, 6); cp(" Ё ");
		g(76, 7); cp(" Ё "); g(76, 8); cp(" Ё "); g(76, 9); cp(" Ё "); g(76,10); cp(" Ё "); g(76,11); cp(" Ё ");
		g(76,12); cp(" Ё "); g(76,13); cp(" Ё "); g(76,14); cp(" Ё "); g(76,15); cp(" Ё "); g(76,16); cp(" Ё ");
		g(76,17); cp(" Ё "); g(76,18); cp(" Ё "); g(76,19); cp(" Ё "); g(76,20); cp(" Ё ");
		g(76,21); cp(" Ё "); g(76,22); cp(" Ё ");
		g( 1,23); cp(" юдддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды ");

		g(30,12); cp("ThAnK YoU FoR PlAyInG...");

		sleep(1);
		g(38,15); cp(" :3 ");
		g(38,24); cp(" ");

		//TurboLotto: Ranges of Loop
		if(choice == 1)
		{
			cp("UwU");
			g(40,24); cp("");
			loop = 10;
		}
		else if (choice == 0)
		{
			g(46,24); cp("Get READY for the next Draw...");
			loop = 0;
		}
		else
		cp("As a PENALTY!!! Initiate ONE MORE Game!");

		getch();
	}
}